---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarNoConstraints
source: html/9ffe93d9-882e-610a-cf3f-dd66cb8e3422.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarNoConstraints Property

The constraints for the rebar with free form geometry are not set or modifications have caused the automatic constraints to be deleted.
 You can use Edit Constraints to assign new bar constraints.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarNoConstraints { get; }
```